nxp-appcodehub/an-tppfc_mc56f8xxxx/TPPFC_code/TPPFC_MC56F82748_V1.0/Static_Code/Peripherals/DACA_Init.c
/** ###################################################################
 **     Filename    : DACA_Init.c
 **     Processor   : MC56F82748VLH
 **     Abstract    :
 **          This file implements the DACA module initialization
 **          according to the Peripheral Initialization settings, and
 **          defines interrupt service routines prototypes.
 **
 **     Contents    :
 **         Int   - void DACA_Init(void);
 **
 **     Copyright : 1997 - 2014 Freescale Semiconductor, Inc.
 **     All Rights Reserved.
 **
 **     Redistribution and use in source and binary forms, with or without modification,
 **     are permitted provided that the following conditions are met:
 **
 **     o Redistributions of source code must retain the above copyright notice, this list
 **       of conditions and the following disclaimer.
 **
 **     o Redistributions in binary form must reproduce the above copyright notice, this
 **       list of conditions and the following disclaimer in the documentation and/or
 **       other materials provided with the distribution.
 **
 **     o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 **       contributors may be used to endorse or promote products derived from this
 **       software without specific prior written permission.
 **
 **     THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 **     ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 **     WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 **     DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 **     ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 **     (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 **     LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 **     ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 **     (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 **     SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 **
 **     http: www.freescale.com
 **     mail: support@freescale.com
 ** ###################################################################*/

/*!
 * @file DACA_Init.c
 * @brief This file implements the DACA module initialization according to the
 *        Peripheral Initialization settings, and defines interrupt service
 *        routines prototypes.
 */


/* MODULE DACA_Init. */

#include "DACA_Init.h"
#include "MC56F82748.h"
#include "Init_Config.h"

#ifdef __cplusplus
extern "C" {
#endif

void DACA_Init(void) {

  /* Register 'DACA_CTRL1' initialization */
  #ifdef DACA_CTRL1_VALUE
  DACA_CTRL1 = DACA_CTRL1_VALUE;
  #endif

  /* Register 'DACA_DATAREG_FMT0' initialization */
  #ifdef DACA_DATAREG_FMT0_VALUE
  DACA_DATAREG_FMT0 = DACA_DATAREG_FMT0_VALUE;
  #endif

  /* Register 'DACA_DATAREG_FMT1' initialization */
  #ifdef DACA_DATAREG_FMT1_VALUE
  DACA_DATAREG_FMT1 = DACA_DATAREG_FMT1_VALUE;
  #endif

  /* Register 'DACA_MINVAL_FMT0' initialization */
  #ifdef DACA_MINVAL_FMT0_VALUE
  DACA_MINVAL_FMT0 = DACA_MINVAL_FMT0_VALUE;
  #endif

  /* Register 'DACA_MINVAL_FMT1' initialization */
  #ifdef DACA_MINVAL_FMT1_VALUE
  DACA_MINVAL_FMT1 = DACA_MINVAL_FMT1_VALUE;
  #endif

  /* Register 'DACA_MAXVAL_FMT0' initialization */
  #ifdef DACA_MAXVAL_FMT0_VALUE
  DACA_MAXVAL_FMT0 = DACA_MAXVAL_FMT0_VALUE;
  #endif

  /* Register 'DACA_MAXVAL_FMT1' initialization */
  #ifdef DACA_MAXVAL_FMT1_VALUE
  DACA_MAXVAL_FMT1 = DACA_MAXVAL_FMT1_VALUE;
  #endif

  /* Register 'DACA_STEPVAL_FMT0' initialization */
  #ifdef DACA_STEPVAL_FMT0_VALUE
  DACA_STEPVAL_FMT0 = DACA_STEPVAL_FMT0_VALUE;
  #endif

  /* Register 'DACA_STEPVAL_FMT1' initialization */
  #ifdef DACA_STEPVAL_FMT1_VALUE
  DACA_STEPVAL_FMT1 = DACA_STEPVAL_FMT1_VALUE;
  #endif

  /* Register 'DACA_CTRL0' initialization */
  #ifdef DACA_CTRL0_VALUE
  DACA_CTRL0 = DACA_CTRL0_VALUE;
  #endif
}

#ifdef __cplusplus
}
#endif

/* END DACA_Init. */

/** ###################################################################
 **
 **     This file is a part of Processor Expert static initialization
 **     library for Freescale microcontrollers.
 **
 ** ################################################################### */
